app/controllers/cartella_clinicas_controller.rb

SELECT "cartella_clinicas".* FROM "cartella_clinicas"
---
  def show
    @cartella_clinica=CartellaClinica.paginate(page: params[:page], :per_page =>3)

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", nil]]
---
  def edit
    @id=session[:test_id]
    id = params[:id]
    @paziente = Paziente.find(@id)