app/controllers/cartella_clinicas_controller.rb

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 10]]
SELECT "cartella_clinicas".* FROM "cartella_clinicas"
SELECT  "cartella_clinicas".* FROM "cartella_clinicas" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "cartella_clinicas"
---
  def index
    @paziente = Paziente.find(session[:test_id])
    @cartella_clinicas = CartellaClinica.all.reject{|cartella_clinica| cartella_clinica.paziente_id!=session[:test_id]}
    @cartella_clinicas = @cartella_clinicas.paginate(page: params[:page], :per_page => 15)

SELECT  "cartella_clinicas".* FROM "cartella_clinicas" WHERE "cartella_clinicas"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @cartella_clinica=CartellaClinica.find(params[:id])

SELECT  "cartella_clinicas".* FROM "cartella_clinicas" WHERE "cartella_clinicas"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @cartella_clinica = CartellaClinica.find(params[:id])

INSERT INTO "cartella_clinicas" ("diagnosi", "valutazione_anatomica", "valutazione_funzionale", "iniziale_finale", "anamnesi", "data", "chiave", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @id=session[:test_id]
    @cartella_clinica=CartellaClinica.new(cartella_clinica_params)
    respond_to do |format|
      if @cartella_clinica.save

SELECT  "cartella_clinicas".* FROM "cartella_clinicas" WHERE "cartella_clinicas"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cartella_clinicas" SET "diagnosi" = ?, "valutazioneAnatomica" = ?, "valutazioneFunzionale" = ?, "inizialeEfinale" = ?, "anamnesi" = ?, "updated_at" = ? WHERE "cartella_clinicas"."id" = ?  [["diagnosi", "per"], ["valutazioneAnatomica", "o"], ["valutazioneFunzionale", "o"], ["inizialeEfinale", "oo"], ["anamnesi", "oo"], ["updated_at", "2016-12-07 21:55:02.880371"], ["id", 2]]
---
  def update
    @cartella_clinica = CartellaClinica.find(params[:id])
    respond_to do |format|
      if @cartella_clinica.update(cartella_clinica_params)

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "cartella_clinicas".* FROM "cartella_clinicas" WHERE "cartella_clinicas"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "cartella_clinicas" WHERE "cartella_clinicas"."id" = ?  [["id", 2]]
---
  def destroy
    id = params[:id]
    id_paziente = params[:paziente_id]
    @paziente = Paziente.find(id_paziente)
    @cartellaclinica = CartellaClinica.find(id)
    @cartellaclinica.destroy