app/controllers/pazientes_controller.rb

SELECT "pazientes".* FROM "pazientes"  ORDER BY cognome ASC
SELECT COUNT(*) FROM "pazientes"
---
  def index

   @pazientes = Paziente.paginate(page: params[:page], :per_page => 15)

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id]
    @paziente = Paziente.find(id)

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    id = params[:id]
    @paziente = Paziente.find(id)

INSERT INTO "pazientes" ("nome", "cognome", "email", "telefono", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "pino"], ["cognome", "pino"], ["email", "pino"], ["telefono", "2232302302320"], ["created_at", "2016-05-08 14:49:52.710517"], ["updated_at", "2016-05-08 14:49:52.710517"]]
---
  def create
    @paziente = Paziente.new(paziente_params)
    respond_to do |format|
      if @paziente.save

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "pazientes" SET "telefono" = ?, "updated_at" = ? WHERE "pazientes"."id" = ?  [["telefono", "22322302320"], ["updated_at", "2016-05-08 15:00:47.838875"], ["id", 2]]
---
  def update
    id = params[:id]
    @paziente = Paziente.find(id)
    respond_to do |format|
      if @paziente.update(paziente_params)

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pazientes" WHERE "pazientes"."id" = ?  [["id", 1]]
---
  def destroy
    id = params[:id]
    @paziente = Paziente.find(id)
    @paziente.destroy

SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_paziente
      @paziente = Paziente.find(params[:id])