app/controllers/sessions_controller.rb

  def create
    paziente = Paziente.find_by(email: params[:session][:email].downcase)
---
SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."email" = ? LIMIT 1  [["email", "manni@manni.it"]]