app/controllers/static_pages_controller.rb

  def live_search
  nome_p=params[:nome_p]
  cognome_p=params[:cognome_p]
  @paziente = Paziente.where(nome: nome_p, cognome: cognome_p)

  if(@paziente.count==0)
	flash[:info]= "Paziente non trovato"
	redirect_to(:back)

  elsif(@paziente.count >1)
	render 'static_pages/live_search'

  elsif
  @paziente.find_each do |paziente|
---
SELECT "pazientes".* FROM "pazientes" WHERE "pazientes"."nome" = ? AND "pazientes"."cognome" = ?  [["nome", "213123"], ["cognome", "3123"]]
SELECT COUNT(*) FROM "pazientes" WHERE "pazientes"."nome" = ? AND "pazientes"."cognome" = ?  [["nome", "Massimo"], ["cognome", "Manni"]]
SELECT  "pazientes".* FROM "pazientes" WHERE "pazientes"."nome" = ? AND "pazientes"."cognome" = ?  ORDER BY "pazientes"."id" ASC LIMIT 1000  [["nome", "Massimo"], ["cognome", "Manni"]]